we Will be working on realworld dataset to perform opeartions like aggregation,
grouping,transforming etc

In [20]:
import pandas as pd
import numpy as np

In [21]:
url="https://raw.githubusercontent.com/sharmaroshan/Churn-Modelling-Dataset/master/Churn_Modelling.csv"

In [22]:
# Chrun Modeling dataset
dataset=pd.DataFrame(pd.read_csv(url))

In [23]:
dataset

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [24]:
# count number of enteries in gender 
dataset['Gender'].value_counts()

Gender
Male      5457
Female    4543
Name: count, dtype: int64

In [25]:
# count number of instances in Exited
dataset['Exited'].value_counts()

Exited
0    7963
1    2037
Name: count, dtype: int64

I want to work only on these two columns Exited and Gender 
so i will select only these two

In [26]:
data=dataset[['Gender','Exited']]
data

      Gender  Exited
0     Female       1
1     Female       0
2     Female       1
3     Female       0
4     Female       0
...      ...     ...
9995    Male       0
9996    Male       0
9997  Female       1
9998    Male       1
9999  Female       0

[10000 rows x 2 columns]

In [ ]:
# calculate mean 
mean=data.groupby('Gender').mean()

In [28]:
# view only males

data.groupby('Gender').get_group('Male')

     Gender  Exited
5      Male       1
6      Male       0
8      Male       0
9      Male       0
10     Male       0
...     ...     ...
9992   Male       0
9993   Male       0
9995   Male       0
9996   Male       0
9998   Male       1

[5457 rows x 2 columns]

In [30]:
data.groupby('Gender').agg(['mean','count'])

          Exited
            mean count
Gender
Female  0.250715  4543
Male    0.164559  5457

groupby now using three values

In [34]:
data2=dataset[['Gender','Geography','Exited']]
data2

      Gender Geography  Exited
0     Female    France       1
1     Female     Spain       0
2     Female    France       1
3     Female    France       0
4     Female     Spain       0
...      ...       ...     ...
9995    Male    France       0
9996    Male    France       0
9997  Female    France       1
9998    Male   Germany       1
9999  Female    France       0

[10000 rows x 3 columns]

In [36]:
data2.groupby(['Gender','Geography'])

In [37]:
data2.groupby(['Gender','Geography']).mean()

                    Exited
Gender Geography
Female France     0.203450
       Germany    0.375524
       Spain      0.212121
Male   France     0.127134
       Germany    0.278116
       Spain      0.131124

In [49]:
data2.groupby(['Gender','Geography']).mean().sort_values(by='Exited')

                    Exited
Gender Geography
Male   France     0.127134
       Spain      0.131124
Female France     0.203450
       Spain      0.212121
Male   Germany    0.278116
Female Germany    0.375524

In [50]:
data2.groupby(['Gender','Geography']).mean().sort_values(by='Exited',ascending=False)

                    Exited
Gender Geography
Female Germany    0.375524
Male   Germany    0.278116
Female Spain      0.212121
       France     0.203450
Male   Spain      0.131124
       France     0.127134

Now We Will select other columns also like we have Geography, Age , Tenure

In [51]:
data3=dataset[['Geography','Age','Tenure']]

In [54]:
data3.groupby('Geography').agg(['mean','count','max'])

                 Age              Tenure
                mean count max      mean count max
Geography
France     38.511767  5014  92  5.004587  5014  10
Germany    39.771622  2509  84  5.009964  2509  10
Spain      38.890997  2477  88  5.032297  2477  10

In [55]:
data4=dataset[['Exited','Geography','Age','Tenure']]
data4

      Exited Geography  Age  Tenure
0          1    France   42       2
1          0     Spain   41       1
2          1    France   42       8
3          0    France   39       1
4          0     Spain   43       2
...      ...       ...  ...     ...
9995       0    France   39       5
9996       0    France   35      10
9997       1    France   36       7
9998       1   Germany   42       3
9999       0    France   28       4

[10000 rows x 4 columns]

In [61]:
data4.groupby(['Exited','Geography']).agg(['mean','count'])

                        Age          Tenure
                       mean count      mean count
Exited Geography
0      France     37.235966  4204  5.005471  4204
       Germany    37.311504  1695  5.011799  1695
       Spain      37.839147  2064  5.107558  2064
1      France     45.133333   810  5.000000   810
       Germany    44.894349   814  5.006143   814
       Spain      44.147700   413  4.656174   413

Below pargraph is important

In [65]:
data4.groupby(['Exited','Geography']).agg(['mean','count']).sort_values(by=[('Age','mean')])

                        Age          Tenure
                       mean count      mean count
Exited Geography
0      France     37.235966  4204  5.005471  4204
       Germany    37.311504  1695  5.011799  1695
       Spain      37.839147  2064  5.107558  2064
1      Spain      44.147700   413  4.656174   413
       Germany    44.894349   814  5.006143   814
       France     45.133333   810  5.000000   810